stm32-rs/stm32g0xx-hal/src/lib.rs
#![no_std]
#![allow(non_camel_case_types)]

#[cfg(not(any(
    feature = "stm32g070",
    feature = "stm32g071",
    feature = "stm32g030",
    feature = "stm32g031",
    feature = "stm32g041",
    feature = "stm32g081"
)))]
compile_error!(
    "This crate requires one of the following features enabled: stm32g030, stm32g070, stm32g031, stm32g041, stm32g071, stm32g081"
);

extern crate bare_metal;
extern crate void;

pub extern crate cortex_m;
pub extern crate embedded_hal as hal;
pub extern crate nb;
pub extern crate stm32g0;

pub use nb::block;

#[cfg(feature = "stm32g030")]
pub use stm32g0::stm32g030 as stm32;

#[cfg(feature = "stm32g070")]
pub use stm32g0::stm32g07x as stm32;  // TODO will be stm32g070, to be fixed in next pac release

#[cfg(feature = "stm32g031")]
pub use stm32g0::stm32g031 as stm32;

#[cfg(feature = "stm32g041")]
pub use stm32g0::stm32g041 as stm32;

#[cfg(feature = "stm32g071")]
pub use stm32g0::stm32g07x as stm32; // TODO will be stm32g071, to be fixed in next pac release

#[cfg(feature = "stm32g081")]
pub use stm32g0::stm32g081 as stm32;

#[cfg(feature = "rt")]
pub use crate::stm32::interrupt;

pub mod analog;
// #[cfg(any(feature = "stm32g071", feature = "stm32g081"))]
// pub mod comparator;
pub mod crc;
pub mod delay;
pub mod dma;
pub mod exti;
pub mod gpio;
pub mod i2c;
pub mod prelude;
pub mod rcc;
pub mod rng;
pub mod rtc;
pub mod serial;
pub mod spi;
pub mod time;
pub mod timer;
pub mod watchdog;
